Revit 2027 API
ExtElemChangeBeamSectionRegistry Methods
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
RegisterInterface |  Registers a IExtElemChangeBeamSection
ToString | Returns a string that represents the current object.
(Inherited from Object)
Unregister |  Unregisters IExtElemChangeBeamSection.
Top
See Also
Reference
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace